public/man/man1/flatpak.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - flatpak.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - flatpak.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>flatpak - Build, install and run applications and runtimes</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>flatpak</strong> [OPTION…] {COMMAND}</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Flatpak is a tool for managing applications and the runtimes they use.
In the Flatpak model, applications can be built and distributed
independently from the host system they are used on, and they are
isolated from the host system (sandboxed) to some degree, at runtime.</p>
<p>
Flatpak can operate in system-wide or per-user mode. The system-wide
data (runtimes, applications and configuration) is located in
$prefix/var/lib/flatpak/, and the per-user data is in
$HOME/.local/share/flatpak/. Below these locations, there is a local
repository in the repo/ subdirectory and installed runtimes and
applications are in the corresponding runtime/ and app/ subdirectories.</p>
<p>
System-wide remotes can be statically preconfigured by dropping
flatpakrepo files into <em>etc/flatpak/remotes.d</em>.</p>
<p>
In addition to the system-wide installation in $prefix/var/lib/flatpak/,
which is always considered the default one unless overridden, more
system-wide installations can be defined via configuration files in
<em>etc/flatpak/installations.d</em>, which must define at least the id of the
installation and the absolute path to it. Other optional parameters like
DisplayName, Priority or StorageType are also supported.</p>
<p>
Flatpak uses OSTree to distribute and deploy data. The repositories it
uses are OSTree repositories and can be manipulated with the <strong>ostree</strong>
utility. Installed runtimes and applications are OSTree checkouts.</p>
<p>
Basic commands for building flatpaks such as build-init, build and
build-finish are included in the flatpak utility. For higher-level build
support, see the separate *flatpak-builder*(1) tool.</p>
<p>
Flatpak supports installing from sideload repos. These are partial
copies of a repository (generated by <strong>flatpak create-usb</strong>) that are used
as an installation source when offline (and online as a performance
improvement). Such repositories are configured by creating symlinks to
the sideload sources in the sideload-repos subdirectory of the
installation directory (i.e. typically <em>var/lib/flatpak/sideload-repos
or ~</em>.local/share/flatpak/sideload-repos). Additionally symlinks can be
created in /run/flatpak/sideload-repos which is a better location for
non-persistent sources (as it is cleared on reboot). These symlinks can
point to either the directory given to <strong>flatpak create-usb</strong> which by
default writes to the subpath .ostree/repo, or directly to an ostree
repo.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The following global options are understood. Individual commands have
their own options.</p>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Show help options and exit.</p>
</blockquote>
<p>
<strong>-v</strong>, <strong>–verbose</strong></p>
<blockquote>
<p>Show debug information during command processing. Use -vv for more
detail.</p>
</blockquote>
<p>
<strong>–ostree-verbose</strong></p>
<blockquote>
<p>Show OSTree debug information during command processing.</p>
</blockquote>
<p>
<strong>–version</strong></p>
<blockquote>
<p>Print version information and exit.</p>
</blockquote>
<p>
<strong>–default-arch</strong></p>
<blockquote>
<p>Print the default arch and exit.</p>
</blockquote>
<p>
<strong>–supported-arches</strong></p>
<blockquote>
<p>Print the supported arches in priority order and exit.</p>
</blockquote>
<p>
<strong>–gl-drivers</strong></p>
<blockquote>
<p>Print the list of active gl drivers and exit.</p>
</blockquote>
<p>
<strong>–installations</strong></p>
<blockquote>
<p>Print paths of system installations and exit.</p>
</blockquote>
<p>
<strong>–print-system-only</strong></p>
<blockquote>
<p>When the <strong>flatpak –print-updated-env</strong> command is run, only print the
environment for system flatpak installations, not including the user&#39;s
home installation.</p>
</blockquote>
<p>
<strong>–print-updated-env</strong></p>
<blockquote>
<p>Print the set of environment variables needed to use flatpaks, amending
the current set of environment variables. This is intended to be used in
a systemd environment generator, and should not need to be run manually.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
COMMANDS
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>Commands for managing installed applications and runtimes:</p>
<p>
*flatpak-install*(1)</p>
<blockquote>
<p>Install an application or a runtime from a remote or bundle.</p>
</blockquote>
<p>
*flatpak-update*(1)</p>
<blockquote>
<p>Update an installed application or runtime.</p>
</blockquote>
<p>
*flatpak-uninstall*(1)</p>
<blockquote>
<p>Uninstall an installed application or runtime.</p>
</blockquote>
<p>
*flatpak-mask*(1)</p>
<blockquote>
<p>Mask out updates and automatic installation.</p>
</blockquote>
<p>
*flatpak-pin*(1)</p>
<blockquote>
<p>Pin runtimes to prevent automatic removal.</p>
</blockquote>
<p>
*flatpak-list*(1)</p>
<blockquote>
<p>List installed applications and/or runtimes.</p>
</blockquote>
<p>
*flatpak-info*(1)</p>
<blockquote>
<p>Show information for an installed application or runtime.</p>
</blockquote>
<p>
*flatpak-history*(1)</p>
<blockquote>
<p>Show history.</p>
</blockquote>
<p>
*flatpak-config*(1)</p>
<blockquote>
<p>Manage flatpak configuration.</p>
</blockquote>
<p>
*flatpak-repair*(1)</p>
<blockquote>
<p>Repair flatpak installation.</p>
</blockquote>
<p>
*flatpak-create-usb*(1)</p>
<blockquote>
<p>Copy apps and/or runtimes onto removable media.</p>
</blockquote>
<p>
Commands for finding applications and runtimes:</p>
<p>
*flatpak-search*(1)</p>
<blockquote>
<p>Search for applications and runtimes.</p>
</blockquote>
<p>
Commands for managing running applications:</p>
<p>
*flatpak-run*(1)</p>
<blockquote>
<p>Run an application.</p>
</blockquote>
<p>
*flatpak-kill*(1)</p>
<blockquote>
<p>Stop a running application.</p>
</blockquote>
<p>
*flatpak-override*(1)</p>
<blockquote>
<p>Override permissions for an application.</p>
</blockquote>
<p>
*flatpak-make-current*(1)</p>
<blockquote>
<p>Specify the default version to run.</p>
</blockquote>
<p>
*flatpak-enter*(1)</p>
<blockquote>
<p>Enter the namespace of a running application.</p>
</blockquote>
<p>
Commands for managing file access:</p>
<p>
*flatpak-document-export*(1)</p>
<blockquote>
<p>Grant an application access to a specific file.</p>
</blockquote>
<p>
*flatpak-document-unexport*(1)</p>
<blockquote>
<p>Revoke access to a specific file.</p>
</blockquote>
<p>
*flatpak-document-info*(1)</p>
<blockquote>
<p>Show information about a specific file.</p>
</blockquote>
<p>
*flatpak-documents*(1)</p>
<blockquote>
<p>List exported files.</p>
</blockquote>
<p>
Commands for managing the dynamic permission store:</p>
<p>
*flatpak-permission-remove*(1)</p>
<blockquote>
<p>Remove item from permission store.</p>
</blockquote>
<p>
*flatpak-permissions*(1)</p>
<blockquote>
<p>List permissions.</p>
</blockquote>
<p>
*flatpak-permission-show*(1)</p>
<blockquote>
<p>Show app permissions.</p>
</blockquote>
<p>
*flatpak-permission-reset*(1)</p>
<blockquote>
<p>Reset app permissions.</p>
</blockquote>
<p>
*flatpak-permission-set*(1)</p>
<blockquote>
<p>Set app permissions.</p>
</blockquote>
<p>
Commands for managing remote repositories:</p>
<p>
*flatpak-remotes*(1)</p>
<blockquote>
<p>List all configured remote repositories.</p>
</blockquote>
<p>
*flatpak-remote-add*(1)</p>
<blockquote>
<p>Add a new remote repository.</p>
</blockquote>
<p>
*flatpak-remote-modify*(1)</p>
<blockquote>
<p>Modify properties of a configured remote repository.</p>
</blockquote>
<p>
*flatpak-remote-delete*(1)</p>
<blockquote>
<p>Delete a configured remote repository.</p>
</blockquote>
<p>
*flatpak-remote-ls*(1)</p>
<blockquote>
<p>List contents of a configured remote repository.</p>
</blockquote>
<p>
*flatpak-remote-info*(1)</p>
<blockquote>
<p>Show information about a ref in a configured remote repository.</p>
</blockquote>
<p>
Commands for building applications:</p>
<p>
*flatpak-build-init*(1)</p>
<blockquote>
<p>Initialize a build directory.</p>
</blockquote>
<p>
*flatpak-build*(1)</p>
<blockquote>
<p>Run a build command in a build directory.</p>
</blockquote>
<p>
*flatpak-build-finish*(1)</p>
<blockquote>
<p>Finalizes a build directory for export.</p>
</blockquote>
<p>
*flatpak-build-export*(1)</p>
<blockquote>
<p>Export a build directory to a repository.</p>
</blockquote>
<p>
*flatpak-build-bundle*(1)</p>
<blockquote>
<p>Create a bundle file from a ref in a local repository.</p>
</blockquote>
<p>
*flatpak-build-import-bundle*(1)</p>
<blockquote>
<p>Import a file bundle into a local repository.</p>
</blockquote>
<p>
*flatpak-build-sign*(1)</p>
<blockquote>
<p>Sign an application or runtime after its been exported.</p>
</blockquote>
<p>
*flatpak-build-update-repo*(1)</p>
<blockquote>
<p>Update the summary file in a repository.</p>
</blockquote>
<p>
*flatpak-build-commit-from*(1)</p>
<blockquote>
<p>Create a new commit based on an existing ref.</p>
</blockquote>
<p>
*flatpak-repo*(1)</p>
<blockquote>
<p>Print information about a repo.</p>
</blockquote>
<p>
Commands available inside the sandbox:</p>
<p>
*flatpak-spawn*(1)</p>
<blockquote>
<p>Run a command in another sandbox.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
FILE FORMATS
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>File formats that are used by Flatpak commands:</p>
<p>
*flatpak-flatpakref*(5)</p>
<blockquote>
<p>Reference to a remote for an application or runtime</p>
</blockquote>
<p>
*flatpak-flatpakrepo*(5)</p>
<blockquote>
<p>Reference to a remote</p>
</blockquote>
<p>
*flatpak-remote*(5)</p>
<blockquote>
<p>Configuration for a remote</p>
</blockquote>
<p>
*flatpak-installation*(5)</p>
<blockquote>
<p>Configuration for an installation location</p>
</blockquote>
<p>
*flatpak-metadata*(5)</p>
<blockquote>
<p>Information about an application or runtime</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
ENVIRONMENT
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>Besides standard environment variables such as <strong>XDG_DATA_DIRS</strong> and
<strong>XDG_DATA_HOME</strong>, flatpak is consulting some of its own.</p>
<p>
<strong>FLATPAK_USER_DIR</strong></p>
<blockquote>
<p>The location of the per-user installation. If this is not set,
$XDG_DATA_HOME/flatpak is used.</p>
</blockquote>
<p>
<strong>FLATPAK_SYSTEM_DIR</strong></p>
<blockquote>
<p>The location of the default system-wide installation. If this is not
set, /var/lib/flatpak is used (unless overridden at build time by
–localstatedir or –with-system-install-dir).</p>
</blockquote>
<p>
<strong>FLATPAK_SYSTEM_CACHE_DIR</strong></p>
<blockquote>
<p>The location where temporary child repositories will be created during
pulls into the system-wide installation. If this is not set, a directory
in <em>var/tmp</em> is used. This is useful because it is more likely to be on
the same filesystem as the system repository (thus increasing the
chances for e.g. reflink copying), and we can avoid filling the users
home directory with temporary data.</p>
</blockquote>
<p>
<strong>FLATPAK_CONFIG_DIR</strong></p>
<blockquote>
<p>The location of flatpak site configuration. If this is not set,
/etc/flatpak is used (unless overridden at build time by –sysconfdir).</p>
</blockquote>
<p>
<strong>FLATPAK_RUN_DIR</strong></p>
<blockquote>
<p>The location of flatpak runtime global files. If this is not set,
/run/flatpak is used.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
SEE ALSO
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p><strong>ostree*(1), *ostree.repo*(5), *flatpak-remote*(5),
*flatpak-installation*(5), *<a href="https://www.flatpak.org">https://www.flatpak.org</a></strong></p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
